tutorials/suspensionFlows/oilWaxFoam/3dpipe/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 303;

boundaryField
{
   inlet
    {
        type            fixedValue;
        value           uniform 303;
    }

    outlet
    {
        type            zeroGradient;
    }

   walls
    {
        type            fixedValue;
        value           uniform 278;
    }


}

// ************************************************************************* //
