tutorials/suspensionFlows/oilWaxFoam/3dpipe/0/Uslip.orig

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Uslip;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
      inlet
      {
      type            zeroGradient;
      value           uniform (0 0 0.22);
      }

      outlet
      {
          type        zeroGradient;

      }


    walls
    {
        type            noSlip;
    }


}

// ************************************************************************* //
